load-test/PMService_load_test2.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="server_ip" elementType="Argument">
            <stringProp name="Argument.name">server_ip</stringProp>
            <stringProp name="Argument.value">10.45.239.31</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1346250201000</longProp>
        <longProp name="ThreadGroup.end_time">1346250202000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">datasets/pmdataset.csv</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">All threads</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">FDN,SOURCE_DIRECTORY,SOURCE_FILE_NAME,DESTINATION_DIRECTORY,DESTINATION_FILE_NAME,JOB_ID</stringProp>
        </CSVDataSet>
        <hashTree/>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Call PMService with parameters" enabled="true">
          <stringProp name="TestPlan.comments">Variables used here are loaded from the CSV file pmdataset.csv</stringProp>
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="EJB_Address" elementType="Argument">
                <stringProp name="Argument.name">EJB_Address</stringProp>
                <stringProp name="Argument.value">ejb:PMService/PMService-ejb//FileCollectionServiceImpl!com.ericsson.oss.services.pm.service.api.FileCollectionServiceRemote</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="JBoss_App_Username" elementType="Argument">
                <stringProp name="Argument.name">JBoss_App_Username</stringProp>
                <stringProp name="Argument.value">guest</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="JBoss_App_Password" elementType="Argument">
                <stringProp name="Argument.name">JBoss_App_Password</stringProp>
                <stringProp name="Argument.value">guestp</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider_url" elementType="Argument">
                <stringProp name="Argument.name">provider_url</stringProp>
                <stringProp name="Argument.value">${server_ip}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="initial_context_factory" elementType="Argument">
                <stringProp name="Argument.name">initial_context_factory</stringProp>
                <stringProp name="Argument.value">org.jboss.naming.remote.client.InitialContextFactory</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Connection_Factory" elementType="Argument">
                <stringProp name="Argument.name">Connection_Factory</stringProp>
                <stringProp name="Argument.value">jms/RemoteConnectionFactory</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Source_File" elementType="Argument">
                <stringProp name="Argument.name">Source_File</stringProp>
                <stringProp name="Argument.value">${SOURCE_FILE_NAME}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Source_Dir" elementType="Argument">
                <stringProp name="Argument.name">Source_Dir</stringProp>
                <stringProp name="Argument.value">${SOURCE_DIRECTORY}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Destination_File" elementType="Argument">
                <stringProp name="Argument.name">Destination_File</stringProp>
                <stringProp name="Argument.value">${DESTINATION_FILE_NAME}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Destination_Dir" elementType="Argument">
                <stringProp name="Argument.name">Destination_Dir</stringProp>
                <stringProp name="Argument.value">${DESTINATION_DIRECTORY}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Target_Node_FDN" elementType="Argument">
                <stringProp name="Argument.name">Target_Node_FDN</stringProp>
                <stringProp name="Argument.value">${FDN}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="job_id" elementType="Argument">
                <stringProp name="Argument.name">job_id</stringProp>
                <stringProp name="Argument.value">${JOB_ID}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Result_Queue" elementType="Argument">
                <stringProp name="Argument.name">Result_Queue</stringProp>
                <stringProp name="Argument.value">jms/queue/FileCollectionResponseQueue</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.ericsson.test.jmeter.jee.EjbSampler</stringProp>
        </JavaSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <SubscriberSampler guiclass="JMSSubscriberGui" testclass="SubscriberSampler" testname="JMS Subscriber" enabled="true">
          <stringProp name="jms.jndi_properties">false</stringProp>
          <stringProp name="jms.initial_context_factory">org.jboss.naming.remote.client.InitialContextFactory</stringProp>
          <stringProp name="jms.provider_url">remote://${server_ip}:4447</stringProp>
          <stringProp name="jms.connection_factory">jms/RemoteConnectionFactory</stringProp>
          <stringProp name="jms.topic">jms/queue/FileCollectionResponseQueue</stringProp>
          <stringProp name="jms.security_principle">guest</stringProp>
          <stringProp name="jms.security_credentials">guestp</stringProp>
          <boolProp name="jms.authenticate">true</boolProp>
          <stringProp name="jms.iterations">1</stringProp>
          <stringProp name="jms.read_response">true</stringProp>
          <stringProp name="jms.client_choice">jms_subscriber_on_message</stringProp>
          <stringProp name="jms.separator">,</stringProp>
          <boolProp name="jms.destination_static">false</boolProp>
          <stringProp name="jms.timeout">0</stringProp>
        </SubscriberSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1346250204000</longProp>
        <longProp name="ThreadGroup.end_time">1346250205000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">datasets/pmdataset.csv</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">All threads</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">FDN,SOURCE_DIRECTORY,SOURCE_FILE_NAME,DESTINATION_DIRECTORY,DESTINATION_FILE_NAME,JOB_ID</stringProp>
        </CSVDataSet>
        <hashTree/>
        <JavaSampler guiclass="JavaTestSamplerGui" testclass="JavaSampler" testname="Call PMService with parameters" enabled="true">
          <stringProp name="TestPlan.comments">Variables used here are loaded from the CSV file pmdataset.csv</stringProp>
          <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="EJB_Address" elementType="Argument">
                <stringProp name="Argument.name">EJB_Address</stringProp>
                <stringProp name="Argument.value">ejb:PMService/PMService-ejb//FileCollectionServiceImpl!com.ericsson.oss.services.pm.service.api.FileCollectionServiceRemote</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="JBoss_App_Username" elementType="Argument">
                <stringProp name="Argument.name">JBoss_App_Username</stringProp>
                <stringProp name="Argument.value">guest</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="JBoss_App_Password" elementType="Argument">
                <stringProp name="Argument.name">JBoss_App_Password</stringProp>
                <stringProp name="Argument.value">guestp</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="provider_url" elementType="Argument">
                <stringProp name="Argument.name">provider_url</stringProp>
                <stringProp name="Argument.value">${server_ip}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="initial_context_factory" elementType="Argument">
                <stringProp name="Argument.name">initial_context_factory</stringProp>
                <stringProp name="Argument.value">org.jboss.naming.remote.client.InitialContextFactory</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Connection_Factory" elementType="Argument">
                <stringProp name="Argument.name">Connection_Factory</stringProp>
                <stringProp name="Argument.value">jms/RemoteConnectionFactory</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Source_File" elementType="Argument">
                <stringProp name="Argument.name">Source_File</stringProp>
                <stringProp name="Argument.value">${SOURCE_FILE_NAME}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Source_Dir" elementType="Argument">
                <stringProp name="Argument.name">Source_Dir</stringProp>
                <stringProp name="Argument.value">${SOURCE_DIRECTORY}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Destination_File" elementType="Argument">
                <stringProp name="Argument.name">Destination_File</stringProp>
                <stringProp name="Argument.value">${DESTINATION_FILE_NAME}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Destination_Dir" elementType="Argument">
                <stringProp name="Argument.name">Destination_Dir</stringProp>
                <stringProp name="Argument.value">${DESTINATION_DIRECTORY}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Target_Node_FDN" elementType="Argument">
                <stringProp name="Argument.name">Target_Node_FDN</stringProp>
                <stringProp name="Argument.value">${FDN}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="job_id" elementType="Argument">
                <stringProp name="Argument.name">job_id</stringProp>
                <stringProp name="Argument.value">${JOB_ID}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="Result_Queue" elementType="Argument">
                <stringProp name="Argument.name">Result_Queue</stringProp>
                <stringProp name="Argument.value">jms/queue/FileCollectionResponseQueue</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="classname">com.ericsson.test.jmeter.jee.EjbSampler</stringProp>
        </JavaSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <SubscriberSampler guiclass="JMSSubscriberGui" testclass="SubscriberSampler" testname="JMS Subscriber" enabled="true">
          <stringProp name="jms.jndi_properties">false</stringProp>
          <stringProp name="jms.initial_context_factory">org.jboss.naming.remote.client.InitialContextFactory</stringProp>
          <stringProp name="jms.provider_url">remote://${server_ip}:4447</stringProp>
          <stringProp name="jms.connection_factory">jms/RemoteConnectionFactory</stringProp>
          <stringProp name="jms.topic">jms/queue/FileCollectionResponseQueue</stringProp>
          <stringProp name="jms.security_principle">guest</stringProp>
          <stringProp name="jms.security_credentials">guestp</stringProp>
          <boolProp name="jms.authenticate">true</boolProp>
          <stringProp name="jms.iterations">1</stringProp>
          <stringProp name="jms.read_response">true</stringProp>
          <stringProp name="jms.client_choice">jms_subscriber_on_message</stringProp>
          <stringProp name="jms.separator">,</stringProp>
          <boolProp name="jms.destination_static">false</boolProp>
          <stringProp name="jms.timeout">0</stringProp>
        </SubscriberSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>